app/Controllers/Achat.php

    public function liste()
    {
        if (!session()->get('isLoggedIn')) {
            return redirect()->to('/login');
        }

        $db = \Config\Database::connect();

        $builder = $db->table('achat');
        $builder->select('achat.*, caisse.numero as caisse_numero, caissier.email as caissier_email');
        $builder->join('caisse', 'caisse.id_caisse = achat.id_caisse', 'left');
        $builder->join('caissier', 'caissier.id_caissier = achat.id_caissier', 'left');
        $builder->orderBy('achat.date_achat', 'DESC');

        $achats = $builder->get()->getResultArray();
---
SELECT `achat`.*, `caisse`.`numero` as `caisse_numero`, `caissier`.`email` as `caissier_email`
FROM `achat`
LEFT JOIN `caisse` ON `caisse`.`id_caisse` = `achat`.`id_caisse`
LEFT JOIN `caissier` ON `caissier`.`id_caissier` = `achat`.`id_caissier`
ORDER BY `achat`.`date_achat` DESC