app/Controllers/Achat.php

SELECT *
FROM `produit`
SELECT *
FROM `client`
---
    public function saisie(): string
    {
        $produitModel = new ProduitModel();
        $produits     = $produitModel->findAll();

        $clientModel = new ClientModel();
        $clients = $clientModel->findAll();

SELECT *
FROM `produit`
WHERE `produit`.`id_produit` = 5
---
    public function ajouter(): \CodeIgniter\HTTP\RedirectResponse
    {
        $validation = \Config\Services::validation();

        $regles = [
            'id_produit' => [
                'label' => 'Produit',
                'rules' => 'required|is_natural_no_zero',
            ],
            'quantite' => [
                'label' => 'Quantité',
                'rules' => 'required|is_natural_no_zero|less_than_equal_to[9999]',
            ],
        ];

        if (! $this->validate($regles)) {
            session()->setFlashdata('error', implode('<br>', $this->validator->getErrors()));
            return redirect()->to(site_url('achat/saisie'));
        }

        $idProduit = (int) $this->request->getPost('id_produit');
        $quantite  = (int) $this->request->getPost('quantite');

        $produitModel = new ProduitModel();
        $produit      = $produitModel->find($idProduit);