app/Controllers/Auth.php

    public function login()
    {
        if (session()->get('isLoggedIn')) {
            return redirect()->to('/dashboard');
        }

        if (strtolower($this->request->getMethod()) === 'post') {
            $rules = [
                'email' => 'required|valid_email',
                'mot_de_passe' => 'required'
            ];

            if ($this->validate($rules)) {
                $model = new CaissierModel();
                $email = $this->request->getPost('email');
                $password = $this->request->getPost('mot_de_passe');

                $caissier = $model->where('email', $email)->first();
---
SELECT *
FROM `caissier`
WHERE `email` = 'caissier@gmail.com'
 LIMIT 1