app/Controllers/Dashboard.php

SELECT *
FROM `caisse`
---
    public function index()
    {
        if (!session()->get('isLoggedIn')) {
            return redirect()->to('/login');
        }

        $caisseModel = new CaisseModel();
        $data['caisses'] = $caisseModel->findAll();

SELECT *
FROM `caisse`
WHERE `caisse`.`id_caisse` = '2'
---
    public function validerCaisse()
    {
        if (!session()->get('isLoggedIn')) {
            return redirect()->to('/login');
        }

        $caisseId = $this->request->getPost('caisse_id');
        $caisseModel = new CaisseModel();
        $caisse = $caisseModel->find($caisseId);