app/Models/AchatModel.php

SELECT *
FROM `v_achat`
ORDER BY `date_achat` DESC
---
    public function getAchatsWithDetails(): array
    {
        $achats = $this->db->table('v_achat')->orderBy('date_achat', 'DESC')->get()->getResultArray();

SELECT *
FROM `v_achat`
WHERE `id_achat` = '1'
SELECT *
FROM `v_achat_details`
WHERE `id_achat` = '1'
---
    public function getAchatWithDetailsById($id)
    {
        $achat = $this->db->table('v_achat')->where('id_achat', $id)->get()->getRowArray();

        if (!$achat) {
            return null;
        }

        $details = $this->db->table('v_achat_details')->where('id_achat', $id)->get()->getResultArray();