app/Models/ProduitModel.php

SELECT *
FROM `produit`
ORDER BY `designation` ASC
---
    public function tousLesProduits(): array
    {
        return $this->orderBy('designation', 'ASC')->findAll();