app/Models/ProduitModel.php

    public function tousLesProduits(): array
    {
        return $this->orderBy('designation', 'ASC')->findAll();
---
SELECT *
FROM `produit`
ORDER BY `designation` ASC